import React from 'react';
import './css/start-page.css';


const StartPage = () => {
    return (
        <div className='start_page page main'>
            <div className="about_us_block">

                <div className="description_block">
                    <div className="description">
                        Мы помогаем решать задачи ваших клиентов на рынке недвижимости Санкт-Петербурга. Лидерские позиции в премиальном сегменте вторичного рынка, а также полный доступ ко всем новостройкам города.
                    </div>

                    <div className="partners">Уже более 1700 партнеров по России.</div>

                </div>

                <div className="offer">
                    Помогаем продавать объекты с высоким чеком
                </div>
            </div>

            <div className="clicks">

                <div className="comission">
                    Получайте <br/> комиссию в
                </div>

                <div className="second">
                    <svg viewBox="0 0 378 520" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M368.658 520L9.34221 520C3.11407 520 0 517.127 0 511.381L0 489.116C0 460.387 5.50951 434.53 16.5285 411.547C28.0266 388.564 42.6388 369.889 60.365 355.525C78.5703 340.681 98.4525 327.274 120.011 315.304C141.57 303.333 163.129 292.32 184.688 282.265C206.247 271.731 226.129 260.958 244.335 249.945C284.578 225.046 304.7 194.162 304.7 157.293C304.7 129.521 293.92 106.059 272.361 86.9061C251.281 67.2744 222.536 57.4585 186.125 57.4585C149.715 57.4585 121.209 67.2744 100.608 86.9061C80.0076 106.538 69.7072 131.436 69.7072 161.602C69.7072 167.348 66.5932 170.221 60.365 170.221H13.654C7.90494 170.221 5.03042 167.348 5.03042 161.602C5.03042 117.072 20.6008 79.0055 51.7414 47.4033C83.3612 15.8011 128.156 0 186.125 0C244.574 0 289.608 15.0829 321.228 45.2486C353.327 74.9355 369.376 110.847 369.376 152.983C369.376 181.713 362.19 207.569 347.817 230.552C333.445 253.536 315.479 271.971 293.92 285.856C272.361 299.263 248.886 312.91 223.494 326.796C198.103 340.203 174.388 352.652 152.35 364.144C130.312 375.157 111.388 389.521 95.5779 407.238C80.2471 424.954 71.8631 444.586 70.4259 466.133L314.76 466.133V414.42C314.76 408.674 317.635 405.801 323.384 405.801H368.658C374.886 405.801 378 408.674 378 414.42V511.381C378 517.127 374.886 520 368.658 520Z" />
                    </svg>

                    <p>клика</p>
                </div>

            </div>
        </div>
    );
};

export default StartPage;